In [15]:
import logging
import openpyxl
import re
import traceback
import pandas as pd
import requests as rq
from collections import defaultdict
from random import randint

### Define Constants

In [46]:
GOOGLE_SHEET_LINK = 'https://docs.google.com/spreadsheets/d/1u9xez7cCm2zTK65cn1WrtmKDK2FuqfckQ44PxGXfmLc/edit#gid=0'

EXCEL_FILENAME = 'google_sheet_excel.xlsx'

SQL_IMPLEMENTATION = 'postgres' ### postgres, mysql, sqlserver

SHOW_PRINT = False

ERROR_LOG_STRING_FORMAT = '''
    {section_title}
    ---
    {description}
    ---
    {error_message}
''' + '='*60 + '\n\n'

In [47]:
INCONSISTENT_COLUMNS = defaultdict(
    lambda : {'datetime' : 'datetime'},
    {
        'postgres': {'datetime' : 'timestamp'}
    }
)

DTYPES_MAPPING = {
    'object' : 'varchar(255)',
    'int' : 'int',
    'float' : 'float'
}

DTYPES_MAPPING = {**DTYPES_MAPPING, **INCONSISTENT_COLUMNS[SQL_IMPLEMENTATION]}
if SHOW_PRINT:
    print(DTYPES_MAPPING)

### Logging Helper

In [12]:
def error_logging_helper(log_filename:str = 'all_logs.log', logger_name:str = 'error_logger'):
    '''
    helper function for logging errors
    '''
    logger = logging.getLogger(logger_name)
    handler = logging.FileHandler(
        filename=log_filename,
        mode='a+'
    )
    log_format = logging.Formatter('%(asctime)s - %(message)s')
    handler.setLevel(logging.INFO)
    handler.setFormatter(log_format)
    logger.addHandler(handler)
    logger.setLevel(logging.INFO)
    print(logger.getEffectiveLevel())
    
    return logger

logger = error_logging_helper('all_logs.log')

20

### Download Google Sheet as Excel

In [43]:
def download_xlsx_from_google_sheet():
    '''
    function for downloading google sheet as xlsx file
    
    Returns: boolean value based on success/failure
    '''
    return_bool_value = True
    
    if 'docs.google.com' not in GOOGLE_SHEET_LINK and 'spreadsheets' not in GOOGLE_SHEET_LINK:
        logger.error(
            ERROR_LOG_STRING_FORMAT.format(
                section_title = 'Error occured in downloading google sheet. Please check google sheet link',
                description = GOOGLE_SHEET_LINK,
                error_message = GOOGLE_SHEET_LINK
            )
        )
        return_bool_value = False
    else:
        try:
            ### extract id and try downloading google sheet
            google_sheet_id = re.search(
                pattern = r'(\/d\/)(\w+)(\/)',
                string = GOOGLE_SHEET_LINK
            ).group(2)

            sheet_download_rq = rq.get(
                url = 'https://docs.google.com/spreadsheets/u/0/d/' + google_sheet_id + "/export",
                params = {
                    'format' : 'xlsx',
                    'id' : google_sheet_id
                },
                stream = True
            )
    
            ### if permission error log error else create xlsx file
            if 'sign in' in sheet_download_rq.text.lower():
                logger.error(
                    ERROR_LOG_STRING_FORMAT.format(
                        section_title = 'Error occured in downloading google sheet. Please check google sheet link',
                        description = GOOGLE_SHEET_LINK,
                        error_message = sheet_download_rq.url
                    )
                )
                return_bool_value = False
            else:
                with sheet_download_rq as f:
                    with open(EXCEL_FILENAME, 'wb') as output:
                        output.write(f.content)
                    
                return_bool_value = True
            
        except Exception as e:
            logger.error(
                ERROR_LOG_STRING_FORMAT.format(
                    section_title = 'Error occured in downloading google sheet. Please check google sheet link: ' + GOOGLE_SHEET_LINK,
                    description = str(e),
                    error_message = str(traceback.format_exc())
                )
            )
            
            return_bool_value = False
            
    return return_bool_value

### Open Downloaded Excel and Convert to DataFrame

In [6]:
def convert_sheets_to_dfs(workbook:openpyxl.workbook.workbook.Workbook, sheet_name:str):
    '''
    takes the sheetname and openpyxl workbook and returns a dataframe 
    and dataypes of each column
    
    Inputs:
        workbook: openpyxl workbook variable obtained using openpyxl.load_workbook()
        sheet_name: name of the sheet
    
    Returns: dataframe df and df.dtypes
    '''
    sheet_data = workbook[sheet_name].values
    df = pd.DataFrame(sheet_data, columns = next(sheet_data))
    df = df.dropna(axis=1, how='all').dropna(axis=0, how='all')
    
    if SHOW_PRINT:
        print(df.head(3), end="\n\n")
        print(df.dtypes, end="\n\n")
    
    return df, df.dtypes

### Helper Functions for Generating Queries

In [7]:
def generate_create_table_query(dtype_df:pd.core.series.Series, table_name:str):
    '''
    function for generating the create ddl query
    
    Inputs:
        - dtype_df: pandas series with dtypes obtained form the `convert_sheets_to_dfs` function
        - table_name: name of the table to be created
        
    Returns:
        - string with create ddl query
    '''
    
    create_table_structure = '''
    create table {table_name} (
    {columns_dtypes}
    );
    '''
    
    complete_colname_dtype_string = ''

    for col, dtype in dtype_df.iteritems():
        cleaned_dtype = re.search(r'([a-zA-Z]+)', str(dtype)).group()
        colname_dtype_string = '\t' + col + ' ' + DTYPES_MAPPING[cleaned_dtype] + ',\n'
        complete_colname_dtype_string += colname_dtype_string

    complete_colname_dtype_string = complete_colname_dtype_string.rsplit(
        sep=',',
        maxsplit=1
    )[0]
    
    create_table_query_populated = create_table_structure.format(
        table_name = table_name,
        columns_dtypes = complete_colname_dtype_string
    )
    
    print(create_table_query_populated)
    
    return create_table_query_populated

In [8]:
def generate_insert_values_query(df:pd.DataFrame, table_name:str):
    '''
    function for generating the `insert into table values` query
    
    Inputs:
        - df: pandas dataframe obtained from the `convert_sheets_to_dfs` function
        - table_name: name of the table to be created
        
    Returns:
        - string with insert query
    '''
    
    insert_query_structure = '''
    insert into 
        {table_name} ({col_names}) 
    values
    {values_query_string}
    ;
    
    select * from {table_name};
    '''
    
    ### create a new col in the dataframe with all other columns concatenated as string
    df['final_col'] = ''
    
    for col in df.dtypes.index:
        if col != 'final_col':
            df['final_col'] += "'" + df[col].astype(str) + "', "
            
    df['final_col'] = df['final_col'].apply(lambda x: "\t(" + x.rsplit(sep=',', maxsplit=1)[0] + ")")
    
    insert_values_query_string = ',\n'.join(df['final_col'].values)
    colnames_string = ', '.join(df.drop('final_col', axis=1).dtypes.index)
    
    insert_query_populated = insert_query_structure.format(
        table_name = table_name,
        col_names = colnames_string,
        values_query_string = insert_values_query_string
    )
    
    print(insert_query_populated)
    
    return insert_query_populated

### Connect Everything Together

In [48]:
download_check = download_xlsx_from_google_sheet()

if download_check:
    wb = openpyxl.load_workbook(EXCEL_FILENAME)
    print(wb.sheetnames)
    
    for sheet_name in wb.sheetnames:
        ### clean up sheet name to make a valid table name
        table_name = sheet_name.replace(' ', '')
        table_name = ''.join(
            re.findall('(\w+)', table_name)
        )
        if table_name == '':
            table_name = 'table_'+str(randint(1, 100000))

        print("###"*15, " ", sheet_name, ":", table_name, " ", "###"*15)

        df, dtype_df = convert_sheets_to_dfs(wb, sheet_name)

        print("~~~"*15)
        create_table_query_populated = generate_create_table_query(dtype_df, table_name)
        insert_query_populated = generate_insert_values_query(df, table_name)
        print("~~~"*15)

        print("###"*35, end="\n\n")
else:
    print(download_check)

['!@#%^&(($%', 'table 2', 'table 3']
#############################################   !@#%^&(($% : table_85971   #############################################
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    create table table_85971 (
    	merchant_id varchar(255),
	merchant_name varchar(255),
	state varchar(255),
	city varchar(255),
	mer_score float,
	date timestamp
    );


    insert into
        table_85971 (merchant_id, merchant_name, state, city, mer_score, date)
    values
    	('m1', 'm1', 'Delhi', 'Delhi', '1.0', '2022-01-01'),
	('m2', 'm2', 'Delhi', 'Delhi', '2.0', '2022-01-02'),
	('m3', 'm3', 'Delhi', 'Delhi', '5.0', '2022-01-03'),
	('m4', 'm4', 'Delhi', 'Delhi', '6.0', '2022-01-04'),
	('m5', 'm5', 'Delhi', 'Delhi', '7.0', '2022-01-05'),
	('m6', 'm6', 'Delhi', 'Delhi', '8.0', '2022-01-06'),
	('m7', 'm7', 'Delhi', 'Delhi', '9.0', '2022-01-07'),
	('m8', 'm8', 'Delhi', 'Delhi', '10.0', '2022-01-08'),
	('m9', 'm9', 'Delhi', 'Delhi', '11.0', '2022-01-09'),
	('m10', 'm10', 'Delhi', 'Delhi', '12.0', '2022-01-10'),
	('m11', 'm11', 'Delhi', 'Delhi', '13.0', '2022-01-11'),
	('m12', 'm12', 'Delhi', 'Delhi', '15.0', '2022-01-12'),
	('m13', 'm13', 'Delhi', 'Delhi', '16.0', '2022-01-13'),
	('m14', 'm14', 'Delhi', 'Delhi', '17.0', '2022-01-14'),
	('m15', 'm15', 'Delhi', 'Delhi', '18.0', '2022-01-15'),
	('m16', 'm16', 'MH', 'Nagpur', '1.0', '2022-01-16'),
	('m17', 'm17', 'MH', 'Nagpur', '2.0', '2022-01-17'),
	('m18', 'm18', 'MH', 'Nagpur', '3.0', '2022-01-18'),
	('m19', 'm19', 'MH', 'Nagpur', '5.0', '2022-01-19'),
	('m20', 'm20', 'MH', 'Nagpur', '7.0', '2022-01-20'),
	('m21', 'm21', 'MH', 'Nagpur', '9.0', '2022-01-21'),
	('m22', 'm22', 'MH', 'Nagpur', '11.0', '2022-01-22'),
	('m23', 'm23', 'MH', 'Nagpur', '13.0', '2022-01-23'),
	('m24', 'm24', 'MH', 'Nagpur', '15.0', '2022-01-24'),
	('m25', 'm25', 'MH', 'Nagpur', '17.0', '2022-01-25'),
	('m26', 'm26', 'MH', 'Nagpur', '19.0', '2022-01-26'),
	('m27', 'm27', 'MH', 'Bombay', '21.0', '2022-01-27'),
	('m28', 'm28', 'MH', 'Bombay', '23.0', '2022-01-28'),
	('m29', 'm29', 'MH', 'Bombay', '25.0', '2022-01-29'),
	('m30', 'm30', 'MH', 'Bombay', '26.0', '2022-01-30'),
	('m31', 'm31', 'MH', 'Bombay', '27.0', '2022-01-31'),
	('m32', 'm32', 'MH', 'Bombay', '28.0', '2022-02-01'),
	('m33', 'm33', 'MH', 'Bombay', '29.0', '2022-02-02'),
	('m34', 'm34', 'MH', 'Bombay', '30.0', '2022-02-03'),
	('m35', 'm35', 'MH', 'Bombay', '31.0', '2022-02-04'),
	('m36', 'm36', 'MH', 'Bombay', '32.0', '2022-02-05')
    ;

    select * from table_85971;

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#########################################################################################################

#############################################   table 2 : table2   #############################################
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    create table table2 (
    	fse_id varchar(255),
	fse_name varchar(255),
	state varchar(255),
	city varchar(255),
	fse_score float
    );


    insert into
        table2 (fse_id, fse_name, state, city, fse_score)
    values
    	('fse1', 'fse1', 'Delhi', 'Delhi', '1.0'),
	('fse2', 'fse2', 'Delhi', 'Delhi', '2.0'),
	('fse3', 'fse3', 'Delhi', 'Delhi', '3.0'),
	('fse4', 'fse4', 'MH', 'Bombay', '10.0'),
	('fse5', 'fse5', 'MH', 'Nagpur', '15.0')
    ;

    select * from table2;

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#########################################################################################################

#############################################   table 3 : table3   #############################################
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    create table table3 (
    	fse_id varchar(255),
	fse_name varchar(255),
	state varchar(255),
	city varchar(255),
	fse_score float,
	merchant_id varchar(255),
	merchant_name varchar(255),
	mer_score float,
	m_state varchar(255),
	m_city varchar(255),
	fse_mer_rank float,
	fse_rank float,
	threshold_lower float,
	threshold_higher float
    );


    insert into
        table3 (fse_id, fse_name, state, city, fse_score, merchant_id, merchant_name, mer_score, m_state, m_city, fse_mer_rank, fse_rank, threshold_lower, threshold_higher)
    values
    	('fse1', 'fse1', 'Delhi', 'Delhi', '1.0', 'm1', 'm1', '1.0', 'Delhi', 'Delhi', '1.0', '1.0', '1.0', '5.0'),
	('fse1', 'fse1', 'Delhi', 'Delhi', '1.0', 'm2', 'm2', '2.0', 'Delhi', 'Delhi', '2.0', '1.0', '1.0', '5.0'),
	('fse1', 'fse1', 'Delhi', 'Delhi', '1.0', 'm3', 'm3', '5.0', 'Delhi', 'Delhi', '3.0', '1.0', '1.0', '5.0'),
	('fse1', 'fse1', 'Delhi', 'Delhi', '1.0', 'm4', 'm4', '6.0', 'Delhi', 'Delhi', '4.0', '1.0', '1.0', '5.0'),
	('fse1', 'fse1', 'Delhi', 'Delhi', '1.0', 'm5', 'm5', '7.0', 'Delhi', 'Delhi', '5.0', '1.0', '1.0', '5.0'),
	('fse2', 'fse2', 'Delhi', 'Delhi', '2.0', 'm6', 'm6', '8.0', 'Delhi', 'Delhi', '6.0', '2.0', '6.0', '10.0'),
	('fse2', 'fse2', 'Delhi', 'Delhi', '2.0', 'm7', 'm7', '9.0', 'Delhi', 'Delhi', '7.0', '2.0', '6.0', '10.0'),
	('fse2', 'fse2', 'Delhi', 'Delhi', '2.0', 'm8', 'm8', '10.0', 'Delhi', 'Delhi', '8.0', '2.0', '6.0', '10.0'),
	('fse2', 'fse2', 'Delhi', 'Delhi', '2.0', 'm9', 'm9', '11.0', 'Delhi', 'Delhi', '9.0', '2.0', '6.0', '10.0'),
	('fse2', 'fse2', 'Delhi', 'Delhi', '2.0', 'm10', 'm10', '12.0', 'Delhi', 'Delhi', '10.0', '2.0', '6.0', '10.0'),
	('fse3', 'fse3', 'Delhi', 'Delhi', '3.0', 'm11', 'm11', '13.0', 'Delhi', 'Delhi', '11.0', '3.0', '11.0', '15.0'),
	('fse3', 'fse3', 'Delhi', 'Delhi', '3.0', 'm12', 'm12', '15.0', 'Delhi', 'Delhi', '12.0', '3.0', '11.0', '15.0'),
	('fse3', 'fse3', 'Delhi', 'Delhi', '3.0', 'm13', 'm13', '16.0', 'Delhi', 'Delhi', '13.0', '3.0', '11.0', '15.0'),
	('fse3', 'fse3', 'Delhi', 'Delhi', '3.0', 'm14', 'm14', '17.0', 'Delhi', 'Delhi', '14.0', '3.0', '11.0', '15.0'),
	('fse3', 'fse3', 'Delhi', 'Delhi', '3.0', 'm15', 'm15', '18.0', 'Delhi', 'Delhi', '15.0', '3.0', '11.0', '15.0'),
	('fse4', 'fse4', 'MH', 'Bombay', '10.0', 'm16', 'm16', '1.0', 'MH', 'Nagpur', '1.0', '1.0', '1.0', '5.0'),
	('fse4', 'fse4', 'MH', 'Bombay', '10.0', 'm17', 'm17', '2.0', 'MH', 'Nagpur', '2.0', '1.0', '1.0', '5.0'),
	('fse4', 'fse4', 'MH', 'Bombay', '10.0', 'm18', 'm18', '3.0', 'MH', 'Nagpur', '3.0', '1.0', '1.0', '5.0'),
	('fse4', 'fse4', 'MH', 'Bombay', '10.0', 'm19', 'm19', '5.0', 'MH', 'Nagpur', '4.0', '1.0', '1.0', '5.0'),
	('fse4', 'fse4', 'MH', 'Bombay', '10.0', 'm20', 'm20', '7.0', 'MH', 'Nagpur', '5.0', '1.0', '1.0', '5.0'),
	('fse5', 'fse5', 'MH', 'Nagpur', '15.0', 'm21', 'm21', '9.0', 'MH', 'Nagpur', '6.0', '2.0', '6.0', '10.0'),
	('fse5', 'fse5', 'MH', 'Nagpur', '15.0', 'm22', 'm22', '11.0', 'MH', 'Nagpur', '7.0', '2.0', '6.0', '10.0'),
	('fse5', 'fse5', 'MH', 'Nagpur', '15.0', 'm23', 'm23', '13.0', 'MH', 'Nagpur', '8.0', '2.0', '6.0', '10.0'),
	('fse5', 'fse5', 'MH', 'Nagpur', '15.0', 'm24', 'm24', '15.0', 'MH', 'Nagpur', '9.0', '2.0', '6.0', '10.0'),
	('fse5', 'fse5', 'MH', 'Nagpur', '15.0', 'm25', 'm25', '17.0', 'MH', 'Nagpur', '10.0', '2.0', '6.0', '10.0')
    ;

    select * from table3;

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#########################################################################################################